<template>
  <button @click="$emit('showInfo', eventData)" class="info__button">{{ title }}</button>
</template>

<script>
export default {
  name: "InfoButton",
  props: ["title"],
  data() {
    return {
      eventData: "Fender Squier Affinity – это серия электрогитар и бас-гитар, которая изначально задумывалась как идеальное вложение для начинающих гитаристов. Гитары этой серии – заслуженные обладатели наилучшего соотношения цена / качество / функционал среди всех гитар Squier. Такой инструмент дает гитаристу познакомиться с оригинальным звучанием и эргономикой Fender, и его не потребуется менять как большинство бюджетных электрогитар – высокое качество древесины и фурнитуры позволит гитаре «взрослеть» вместе с уровнем игры своего обладателя. Кроме того, в 2021 году серия Squier Affinity была перевыпущена, и гитары этой серии стали лучше, чем когда-либо! Fender Squier Affinity 2021 Stratocaster HH - это стратокастер, которого еще никогда не было в линейке Affinity. Теперь классический дизайн страта дополнен двумя мощными керамическими хамбакерами, которые позволяют работать в любом тяжелом жанре рока и металла. Сочетание удобства и эргономики страта, а также мощи керамических хамбакеров открывает совершенно новое поле для экспериментов. Как и все новые модели Affinity 2021, электрогитара Fender Squier Affinity 2021 Stratocaster HH отличается повышенным качеством древесины, фурнитуры и электроники. Модернизированный корпус Корпус гитары выполнен из тополя, который по своим физическим характеристикам максимально близок к ольхе – традиционной древесине корпуса американских и мексиканских гитар Fender. При этом толщина корпуса Affinity 2021 Stratocaster HH специально уменьшена на несколько миллиметров относительно стандарта – это снижает массу гитары и повышает удобство игры в любой позиции."
    }; 
  },
};
</script>

<style>
.info__button {
  width: 20%;
  padding: 15px 5px;
  border-radius: 20px;
  color: #fff;
  background-color: #535353;
  border: #fff solid 1px;
  font-size: 24px;
}

.info__button:hover {
  opacity: 0.7;
  cursor: pointer;
}

.info__button:focus {
    border: none;
    border-bottom: 1px solid #fff;
}
</style>
